Python 3.12.5 (tags/v3.12.5:ff3bc82, Aug  6 2024, 20:45:27) [MSC v.1940 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> # Функция для расчета площади прямоугольника.
... # Аргументы:
... # - a (float): Длина прямоугольника.
... # - b (float): Ширина прямоугольника.
... # Возвращает:
... # - float: Площадь прямоугольника.
... # Пример:
... # >>> area(5, 10)
... # 50
... def area(a, b):
...     return a * b
... 
... # Функция для расчета периметра прямоугольника.
... # Аргументы:
... # - a (float): Длина прямоугольника.
... # - b (float): Ширина прямоугольника.
... # Возвращает:
... # - float: Периметр прямоугольника.
... # Пример:
... # >>> perimeter(5, 10)
... # 30
... def perimeter(a, b):
...     return 2 * (a + b)
