Python 3.12.5 (tags/v3.12.5:ff3bc82, Aug  6 2024, 20:45:27) [MSC v.1940 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> # Функция для расчета площади квадрата.
... # Аргументы:
... # - a (float): Длина стороны квадрата.
... # Возвращает:
... # - float: Площадь квадрата.
... # Пример:
... # >>> area(4)
... # 16
... def area(a):
...     return a * a
... 
... # Функция для расчета периметра квадрата.
... # Аргументы:
... # - a (float): Длина стороны квадрата.
... # Возвращает:
... # - float: Периметр квадрата.
... # Пример:
... # >>> perimeter(4)
... # 16
... def perimeter(a):
...     return 4 * a
